/******************************************************************************************
 *         sum(0,4)           -> 返回 sum(0,2) + sum(2,4) = 30 + 70 = 100
        /      \
  sum(0,2)     sum(2,4)    -> sum(0,2) 返回 10+20=30; sum(2,4) 返回 30+40=70
  /     \      /     \
sum(0,1) sum(1,2) sum(2,3) sum(3,4)  -> 每个叶子节点返回单个元素值：10, 20, 30, 40
 ******************************************************************************************/

int sum ( int A[], int lo, int hi ) { //数组求和算法（二分递归版，入口为sum(A, 0, n)）
   if ( hi - lo < 2 ) return A[lo]; //递归基：区间宽度不足2
   int mi = ( lo + hi ) >> 1; //（否则）均分原区间
   return sum ( A, lo, mi ) + sum ( A, mi, hi ); //递归求和，然后合计
} //O(hi - lo)，线性正比于区间的长度